#3. จงเขียนโปรแกรมPython ของโปรแกรมค านวณภาษี ณ ที จ่ายของสินค้า 
#โดยรับชื อสินค้า และราคาสินค้า ทางแป้นพิมพ์และแสดงผลภาษีที ค านวณได้ทางหน้าจอ ทั้งนี้ภาษีคิดที ร้อยละ 7 ของราคาสินค้า
#1.รับค่าข้อมูลของสินค้าทางแป้นพิมพ์ 2.คำนวณภาษีและราคาสินค้า 3.แสดงผลการคำนวณทางหน้าจอ 4.แสดงชื่อของโปรแกรมทางหน้าจอ

def inputData( ) :
    name = input('โปรดป้อนชื่อสินค้าของคุณ : ')
    price = float(input('โปรดป้อนราคาของสินค้า : '))
    return name,price

def calTaxPrice (price ) :
    tax = float(price+(price*7/100))
    return tax

def showTaxprice () :
    print(f'ชื่อสินค้า : {name} ')
    print(f'ราคาสินค้า : {price} บาท')
    print(f'ราคาสินค้ารวมภาษี : {tax} บาท')
    print('**------------------------------------------**')

def showProgramName ( ) :
    print('**------------------------------------------**')
    print('**-----------โปรแกรมคำนวณภาษีของสินค้า--------**')
    print('**------------------------------------------**')

name,price = inputData( )
tax=calTaxPrice(price)
showProgramName( )
showTaxprice( )
